var books = {
    pali: {
        vin: {
            vn: {
                folder: "মূলপাল়ি",
                folder_data: {
                    mula: {
                        title: "ৰিনযপিটক (পাল়ি)",
                        src: ["mula_1_1", "mula_1_2", "mula_1_3", "mula_1_4", "mula_1_5"],
                        bookname: ["পারাজিকপাল়ি", "পাচিত্তিযপাল়ি", "মহাৰগ্গপাল়ি", "চূল়ৰগ্গপাল়ি", "পরিৰারপাল়ি"]
                    },
                    attha: {
                        title: "ৰিনযপিটক (অট্ঠকথা)",
                        src: ["attha_1_1", "attha_1_2", "attha_1_3", "attha_1_4", "attha_1_5"],
                        bookname: ["পারাজিককণ্ড-অট্ঠকথা", "পাচিত্তিয-অট্ঠকথা", "মহাৰগ্গ-অট্ঠকথা", "চূল়ৰগ্গ-অট্ঠকথা", "পরিৰার-অট্ঠকথা"]
                    },
                    thika: {
                        title: "ৰিনযপিটক (টীকা)",
                        src: ["thika_1_1", "thika_1_2", "thika_1_3", "thika_1_4", "thika_1_5", "thika_1_6", "thika_1_7", "thika_1_8", "thika_1_9", "thika_1_10", "thika_1_11", "thika_1_12", "thika_1_13", "thika_1_14", "thika_1_15", "thika_1_16"],
                        bookname: ["পারাজিক-টীকা (সারত্থদীপনী-টীকা ১-২)", "পাচিত্তিয-টীকা (সারত্থদীপনী-টীকা-৩)", "মহাৰগ্গ-টীকা (সারত্থদীপনী-টীকা-৩)", "চূল়ৰগ্গ-টীকা (সারত্থদীপনী-টীকা-৩)", "পরিৰার-টীকা (সারত্থদীপনী-টীকা-৩)", "দ্বেমাতিকাপাল়ি", "ৰিনযসঙ্গহ-অট্ঠকথা", "ৰজিরবুদ্ধি-টীকা", "ৰিমতিৰিনোদনী-টীকা", "ৰিনযালঙ্কার-টীকা", "কঙ্খাৰিতরণীপুরাণ-টীকা", "ৰিনযৰিনিচ্ছয-উত্তরৰিনিচ্ছয", "ৰিনযৰিনিচ্ছয-টীকা", "পাচিত্যাদিযোজনাপাল়ি", "খুদ্দসিক্খা-মূলসিক্খা"]
                    }
                }
            }


        },
        sutta: {
            dn: {
                mula: {
                    src: ["mula_2_1_1", "mula_2_1_2", "mula_2_1_3"],
                    bookname: ["সীলক্খন্ধৰগ্গপাল়ি", "মহাৰগ্গপাল়ি", "পাথিকৰগ্গপাল়ি"]
                },
                attha: {
                    src: ["attha_2_1_1", "attha_2_1_2", "attha_2_1_3"],
                    bookname: ["সীলক্খন্ধৰগ্গ-অট্ঠকথা", "মহাৰগ্গ-অট্ঠকথা", "পাথিকৰগ্গ-অট্ঠকথা"]
                },
                thika: {
                    src: ["thika_2_1_1", "thika_2_1_2", "thika_2_1_3", "thika_2_1_4", "thika_2_1_5"],
                    bookname: ["সীলক্খন্ধৰগ্গ-টীকা", "মহাৰগ্গ-টীকা", "পাথিকৰগ্গ-টীকা", "সীলক্খন্ধৰগ্গ-অভিনৰটীকা-১", "সীলক্খন্ধৰগ্গ-অভিনৰটীকা-২"]
                }
            },
            mn: {
                mula: {
                    src: ["mula_2_2_1", "mula_2_2_2", "mula_2_2_3"],
                    bookname: ["মূলপণ্ণাসপাল়ি", "মজ্ঝিমপণ্ণাসপাল়ি", "উপরিপণ্ণাসপাল়ি"]
                },
                attha: {
                    src: ["attha_2_2_1", "attha_2_2_2", "attha_2_2_3"],
                    bookname: ["মূলপণ্ণাস-অট্ঠকথা", "মজ্ঝিমপণ্ণাস-অট্ঠকথা", "উপরিপণ্ণাস-অট্ঠকথা"]
                },
                thika: {
                    src: ["thika_2_2_1", "thika_2_2_2", "thika_2_2_3"],
                    bookname: ["মূলপণ্ণাস-টীকা", "মজ্ঝিমপণ্ণাস-টীকা", "উপরিপণ্ণাস-টীকা"]
                }
            },
            sn: {
                mula: {
                    src: ["mula_2_3_1", "mula_2_3_2", "mula_2_3_3", "mula_2_3_4", "mula_2_3_5",],
                    bookname: ["সগাথাৰগ্গপাল়ি", "নিদানৰগ্গপাল়ি", "খন্ধৰগ্গপাল়ি", "সল়াযতনৰগ্গপাল়ি", "মহাৰগ্গপাল়ি"]
                },
                attha: {
                    src: ["attha_2_3_1", "attha_2_3_2", "attha_2_3_3", "attha_2_3_4", "attha_2_3_5",],
                    bookname: ["সগাথাৰগ্গ-অট্ঠকথা", "নিদানৰগ্গ-অট্ঠকথা", "খন্ধৰগ্গ-অট্ঠকথা", "সল়াযতনৰগ্গ-অট্ঠকথা", "মহাৰগ্গ-অট্ঠকথা"]
                },
                thika: {
                    src: ["thika_2_3_1", "thika_2_3_2", "thika_2_3_3", "thika_2_3_4", "thika_2_3_5",],
                    bookname: ["সগাথাৰগ্গ-টীকা", "নিদানৰগ্গ-টীকা", "খন্ধৰগ্গ-টীকা", "সল়াযতনৰগ্গ-টীকা", "মহাৰগ্গ-টীকা"]
                }
            },
            an: {
                mula: {
                    src: ["mula_2_4_1", "mula_2_4_2", "mula_2_4_3", "mula_2_4_4", "mula_2_4_5", "mula_2_4_6", "mula_2_4_7", "mula_2_4_8", "mula_2_4_9", "mula_2_4_10", "mula_2_4_11",],
                    bookname: ["এককনিপাতপাল়ি", "দুকনিপাতপাল়ি", "তিকনিপাতপাল়ি", "চতুক্কনিপাতপাল়ি", "পঞ্চকনিপাতপাল়ি", "ছক্কনিপাতপাল়ি", "সত্তকনিপাতপাল়ি", "অট্ঠকাদিনিপাতপাল়ি", "নৰকনিপাতপাল়ি", "দসকনিপাতপাল়ি", "একাদসকনিপাতপাল়ি"]
                },
                attha: {
                    src: ["attha_2_4_1", "attha_2_4_2", "attha_2_4_3", "attha_2_4_4", "attha_2_4_5", "attha_2_4_6", "attha_2_4_7", "attha_2_4_8", "attha_2_4_9", "attha_2_4_10", "attha_2_4_11",],
                    bookname: ["এককনিপাত-অট্ঠকথা", "দুকনিপাত-অট্ঠকথা", "তিকনিপাত-অট্ঠকথা", "চতুক্কনিপাত-অট্ঠকথা", "পঞ্চকনিপাত-অট্ঠকথা", "ছক্কনিপাত-অট্ঠকথা", "সত্তকনিপাত-অট্ঠকথা", "অট্ঠকাদিনিপাত-অট্ঠকথা", "নৰকনিপাত-অট্ঠকথা", "দসকনিপাত-অট্ঠকথা", "একাদসকনিপাত-অট্ঠকথা"]
                },
                thika: {
                    src: ["thika_2_4_1", "thika_2_4_2", "thika_2_4_3", "thika_2_4_4", "thika_2_4_5", "thika_2_4_6", "thika_2_4_7", "thika_2_4_8", "thika_2_4_9", "thika_2_4_10", "thika_2_4_11",],
                    bookname: ["এককনিপাত-টীকা", "দুকনিপাত-টীকা", "তিকনিপাত-টীকা", "চতুক্কনিপাত-টীকা", "পঞ্চকনিপাত-টীকা", "ছক্কনিপাত-টীকা", "সত্তকনিপাত-টীকা", "অট্ঠকাদিনিপাত-টীকা", "নৰকনিপাত-টীকা", "দসকনিপাত-টীকা", "একাদসকনিপাত-টীকা"]
                },
            },
            kn: {
                mula: {
                    src: ["mula_2_5_1", "mula_2_5_2", "mula_2_5_3", "mula_2_5_4", "mula_2_5_5", "mula_2_5_6", "mula_2_5_7", "mula_2_5_8", "mula_2_5_9", "mula_2_5_10", "mula_2_5_11", "mula_2_5_12", "mula_2_5_13", "mula_2_5_14", "mula_2_5_15", "mula_2_5_16", "mula_2_5_17", "mula_2_5_18", "mula_2_5_19", "mula_2_5_20", "mula_2_5_21", "mula_2_5_22", "mula_2_5_23", "mula_2_5_24"],
                    bookname: ["খুদ্দকপাঠপাল়ি", "ধম্মপদপাল়ি", "উদানপাল়ি", "ইতিৰুত্তকপাল়ি", "সুত্তনিপাতপাল়ি", "ৰিমানৰত্থুপাল়ি", "পেতৰত্থুপাল়ি", "থেরগাথাপাল়ি", "থেরীগাথাপাল়ি", "অপদানপাল়ি (১-২)", "বুদ্ধৰংসপাল়ি", "চরিযাপিটকপাল়ি", "জাতকপাল়ি-১", "জাতকপাল়ি-২", "জাতকপাল়ি-৩", "জাতকপাল়ি-৪", "জাতকপাল়ি-৫", "জাতকপাল়ি-৬", "মহানিদ্দেসপাল়ি", "চূল়নিদ্দেসপাল়ি", "পটিসম্ভিদামগ্গপাল়ি", "নেত্তিপ্পকরণপাল়ি", "মিলিন্দপঞ্হপাল়ি", "পেটকোপদেসপাল়ি"]
                },
                attha: {
                    src: ["attha_2_5_1", "attha_2_5_2", "attha_2_5_3", "attha_2_5_4", "attha_2_5_5", "attha_2_5_6", "attha_2_5_7", "attha_2_5_8", "attha_2_5_9", "attha_2_5_10", "attha_2_5_11", "attha_2_5_12", "attha_2_5_13", "attha_2_5_14", "attha_2_5_15", "attha_2_5_16", "attha_2_5_17", "attha_2_5_18", "attha_2_5_19", "attha_2_5_20", "attha_2_5_21", "attha_2_5_22", "", ""],
                    bookname: ["খুদ্দকপাঠ-অট্ঠকথা", "ধম্মপদ-অট্ঠকথা", "উদান-অট্ঠকথা", "ইতিৰুত্তক-অট্ঠকথা", "সুত্তনিপাত-অট্ঠকথা", "ৰিমানৰত্থু-অট্ঠকথা", "পেতৰত্থু-অট্ঠকথা", "থেরগাথা-অট্ঠকথা (১-২)", "থেরীগাথা-অট্ঠকথা", "অপদান-অট্ঠকথা", "বুদ্ধৰংস-অট্ঠকথা", "চরিযাপিটক-অট্ঠকথা", "জাতক-অট্ঠকথা-১", "জাতক-অট্ঠকথা-২", "জাতক-অট্ঠকথা-৩", "জাতক-অট্ঠকথা-৪", "জাতক-অট্ঠকথা-৫", "জাতক-অট্ঠকথা (৬-৭)", "মহানিদ্দেস-অট্ঠকথা", "চূল়নিদ্দেস-অট্ঠকথা", "পটিসম্ভিদামগ্গ-অট্ঠকথা", "নেত্তিপ্পকরণ-অট্ঠকথা"]
                },
                thika: {
                    src: ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "attha_2_5_23", ""],
                    bookname: ["নেত্তিপ্পকরণ-টীকা", "নেত্তিৰিভাৰিনী"]
                }
            }
        },
        abhi: {
            ab: {
                mula: {
                    src: ["mula_3_1", "mula_3_2", "mula_3_3", "mula_3_4", "mula_3_5", "mula_3_6", "mula_3_7", "mula_3_8", "mula_3_9", "mula_3_10", "mula_3_11", "mula_3_12", "mula_3_13",],
                    bookname: ["ধম্মসঙ্গণীপাল়ি", "ৰিভঙ্গপাল়ি", "ধাতুকথাপাল়ি", "পুগ্গলপঞ্ঞত্তিপাল়ি", "কথাৰত্থুপাল়ি", "যমকপাল়ি-১", "যমকপাল়ি-২", "যমকপাল়ি-৩", "পট্ঠানপাল়ি-১", "পট্ঠানপাল়ি-২", "পট্ঠানপাল়ি-৩", "পট্ঠানপাল়ি-৪", "পট্ঠানপাল়ি-৫"]
                },
                attha: {
                    src: ["attha_3_1", "attha_3_2", "attha_3_3", "attha_3_4", "attha_3_5", "attha_3_6", "attha_3_7"],
                    bookname: ["ধম্মসঙ্গণি-অট্ঠকথা", "ৰিভঙ্গ-অট্ঠকথা", "ধাতুকথা-অট্ঠকথা", "পুগ্গলপঞ্ঞত্তি-অট্ঠকথা", "কথাৰত্থু-অট্ঠকথা", "যমকপ্পকরণ-অট্ঠকথা", "পট্ঠানপ্পকরণ-অট্ঠকথা"]
                },
                thika: {
                    src: ["thika_3_1", "thika_3_2", "thika_3_3", "thika_3_4", "thika_3_5", "thika_3_6", "thika_3_7", "thika_3_8", "thika_3_9", "thika_3_10", "thika_3_11", "thika_3_12", "thika_3_13",],
                    bookname: ["ধম্মসঙ্গণি-মূলটীকা", "ৰিভঙ্গ-মূলটীকা", "ধাতুকথা-মূলটীকা", "পুগ্গলপঞ্ঞত্তি-মূলটীকা", "কথাৰত্থু-মূলটীকা", "যমকপ্পকরণ-মূলটীকা", "পট্ঠানপ্পকরণ-মূলটীকা", "ধম্মসঙ্গণী-অনুটীকা", "পঞ্চপকরণ-অনুটীকা", "অভিধম্মাৰতারো-নামরূপপরিচ্ছেদো", "অভিধম্মত্থসঙ্গহো", "অভিধম্মাৰতার-পুরাণটীকা", "অভিধম্মমাতিকাপাল়ি"]
                }
            }
        },
        other: {
            ot1: {
                mula: {
                    src: ["anno_1_1", "anno_1_2", "anno_1_3", "anno_1_4", "anno_1_5"],
                    bookname: ["ৰিসুদ্ধিমগ্গ-১", "ৰিসুদ্ধিমগ্গ-২", "ৰিসুদ্ধিমগ্গ-মহাটীকা-১", "ৰিসুদ্ধিমগ্গ-মহাটীকা-২", "ৰিসুদ্ধিমগ্গ নিদানকথা"]
                }
            },
            ot2: {
                mula: {
                    src: ["anno_2_1", "anno_2_2", "anno_2_3", "anno_2_4", "anno_2_5", "anno_2_6", "anno_2_7"],
                    bookname: ["দীঘনিকায (পু-ৰি)", "মজ্ঝিমনিকায (পু-ৰি)", "সংযুত্তনিকায (পু-ৰি)", "অঙ্গুত্তরনিকায (পু-ৰি)", "ৰিনযপিটক (পু-ৰি)", "অভিধম্মপিটক (পু-ৰি)", "অট্ঠকথা (পু-ৰি)"]
                }
            },
            ot3: {
                mula: {
                    src: ["anno_3_1", "anno_3_2", "anno_3_3", "anno_3_4"],
                    bookname: ["নিরুত্তিদীপনী", "পরমত্থদীপনী সঙ্গহমহাটীকাপাঠ", "অনুদীপনীপাঠ", "পট্ঠানুদ্দেস দীপনীপাঠ"]
                }
            },
            ot4: {
                mula: {
                    src: ["anno_4_1", "anno_4_2", "anno_4_3", "anno_4_4", "anno_4_5", "anno_4_6", "anno_4_7", "anno_4_8"],
                    bookname: ["নমক্কারটীকা", "মহাপণামপাঠ", "লক্খণাতো বুদ্ধথোমনাগাথা", "সুতৰন্দনা", "কমলাঞ্জলি", "জিনালঙ্কার", "পজ্জমধু", "বুদ্ধগুণগাথাৰলী"]
                }
            },
            ot5: {
                mula: {
                    src: ["anno_5_1", "anno_5_2", "anno_5_3"],
                    bookname: ["চূল়গন্থৰংস", "মহাৰংস", "সাসনৰংস"]
                }
            },
            ot6: {
                mula: {
                    src: ["anno_6_1", "anno_6_2", "anno_6_3", "anno_6_4", "anno_6_5", "anno_6_6", "anno_6_7", "anno_6_8", "anno_6_9", "anno_6_10", "anno_6_11", "anno_6_12", "anno_6_13"],
                    bookname: ["কচ্চাযনব্যাকরণং", "মোগ্গল্লানব্যাকরণং", "সদ্দনীতিপ্পকরণং (পদমালা)", "সদ্দনীতিপ্পকরণং (ধাতুমালা)", "পদরূপসিদ্ধি", "মোগল্লানপঞ্চিকা", "পযোগসিদ্ধিপাঠ", "ৰুত্তোদযপাঠ", "অভিধানপ্পদীপিকাপাঠ", "অভিধানপ্পদীপিকাটীকা", "সুবোধালঙ্কারপাঠ", "সুবোধালঙ্কারটীকা", "বালাৰতার গণ্ঠিপদত্থৰিনিচ্ছযসার"]
                }
            },
            ot7: {
                mula: {
                    src: ["anno_7_1", "anno_7_2", "anno_7_3", "anno_7_4", "anno_7_5", "anno_7_6", "anno_7_7", "anno_7_8", "anno_7_9", "anno_7_10"],
                    bookname: ["লোকনীতি", "সুত্তন্তনীতি", "সূরস্সতিনীতি", "মহারহনীতি", "কৰিদপ্পণনীতি", "নীতিমঞ্জরী", "নরদক্খদীপনী", "চতুরারক্খদীপনী", "চাণক্যনীতি"]
                }
            },
            ot8: {
                mula: {
                    src: ["anno_8_1", "anno_8_2", "anno_8_3"],
                    bookname: ["রসৰাহিনী", "সীমৰিসোধনীপাঠ", "ৰেস্সন্তরগীতি"]
                }
            },
            ot9: {
                mula: {
                    src: ["anno_9_1", "anno_9_2", "anno_9_3", "anno_9_4", "anno_9_5", "anno_9_6", "anno_9_7", "anno_9_8", "anno_9_9", "anno_9_10", "anno_9_11", "anno_9_12", "anno_9_13", "anno_9_14", "anno_9_15"],
                    bookname: ["মোগ্গল্লান ৰুত্তিৰিৰরণপঞ্চিকা", "থূপৰংস", "দাঠাৰংস", "ধাতুপাঠৰিলাসিনিযা", "ধাতুৰংস", "হত্থৰনগল্লৰিহারৰংস", "জিনচরিতয", "জিনৰংসদীপং", "তেলকটাহগাথা", "মিলিদটীকা", "পদমঞ্জরী", "পদসাধনং", "সদ্দবিন্দুপকরণং", "কচ্চাযনধাতুমঞ্জুসা", "সামন্তকূটৰণ্ণনা"]
                }
            }
        }
    },
    bangla: {

    },
    eng: {

    }
}


console.log(books.pali.vin.vn.folder_data.mula.src)
var vin = books.pali.vin.vn.folder_data.mula.src
document.getElementById('f2_mula_vin').innerHTML = '<li>' + vin.join(`</li><li>`)



